PinguinoIDE/pinguino-compilers/linux64/p8/share/gputils/header/p16f18323.inc
;-----Bank9------------------
CCDPA            EQU  H'048C'
CCDPC            EQU  H'048E'
NCO1ACCL         EQU  H'0498'
NCO1ACCH         EQU  H'0499'
NCO1ACCU         EQU  H'049A'
NCO1INCL         EQU  H'049B'
NCO1INCH         EQU  H'049C'
NCO1INCU         EQU  H'049D'
NCO1CON          EQU  H'049E'
NCO1CLK          EQU  H'049F'

;-----Bank12------------------
PWM5DCL          EQU  H'0617'
PWM5DCH          EQU  H'0618'
PWM5CON          EQU  H'0619'
PWM5CON0         EQU  H'0619'
PWM6DCL          EQU  H'061A'
PWM6DCH          EQU  H'061B'
PWM6CON          EQU  H'061C'
PWM6CON0         EQU  H'061C'

;-----Bank13------------------
CWG1CLK          EQU  H'0691'
CWG1DAT          EQU  H'0692'
CWG1DBR          EQU  H'0693'
CWG1DBF          EQU  H'0694'
CWG1CON0         EQU  H'0695'
CWG1CON1         EQU  H'0696'
CWG1ASD0         EQU  H'0697'
CWG1ASD1         EQU  H'0698'
CWG1STR          EQU  H'0699'

;-----Bank17------------------
NVMADR           EQU  H'0891'
NVMADRL          EQU  H'0891'
NVMADRH          EQU  H'0892'
NVMDAT           EQU  H'0893'
NVMDATL          EQU  H'0893'
NVMDATH          EQU  H'0894'
NVMCON1          EQU  H'0895'
NVMCON2          EQU  H'0896'
PCON0            EQU  H'089B'

;-----Bank18------------------
PMD0             EQU  H'0911'
PMD1             EQU  H'0912'
PMD2             EQU  H'0913'
PMD3             EQU  H'0914'
PMD4             EQU  H'0915'
PMD5             EQU  H'0916'
CPUDOZE          EQU  H'0918'
OSCCON1          EQU  H'0919'
OSCCON2          EQU  H'091A'
OSCCON3          EQU  H'091B'
OSCSTAT1         EQU  H'091C'
OSCEN            EQU  H'091D'
OSCTUNE          EQU  H'091E'
OSCFRQ           EQU  H'091F'

;-----Bank28------------------
PPSLOCK          EQU  H'0E0F'
INTPPS           EQU  H'0E10'
T0CKIPPS         EQU  H'0E11'
T1CKIPPS         EQU  H'0E12'
T1GPPS           EQU  H'0E13'
CCP1PPS          EQU  H'0E14'
CCP2PPS          EQU  H'0E15'
CWG1PPS          EQU  H'0E18'
MDCIN1PPS        EQU  H'0E1A'
MDCIN2PPS        EQU  H'0E1B'
MDMINPPS         EQU  H'0E1C'
SSP1CLKPPS       EQU  H'0E20'
SSP1DATPPS       EQU  H'0E21'
SSP1SSPPS        EQU  H'0E22'
RXPPS            EQU  H'0E24'
TXPPS            EQU  H'0E25'
CLCIN0PPS        EQU  H'0E28'
CLCIN1PPS        EQU  H'0E29'
CLCIN2PPS        EQU  H'0E2A'
CLCIN3PPS        EQU  H'0E2B'

;-----Bank29------------------
RA0PPS           EQU  H'0E90'
RA1PPS           EQU  H'0E91'
RA2PPS           EQU  H'0E92'
RA4PPS           EQU  H'0E94'
RA5PPS           EQU  H'0E95'
RC0PPS           EQU  H'0EA0'
RC1PPS           EQU  H'0EA1'
RC2PPS           EQU  H'0EA2'
RC3PPS           EQU  H'0EA3'
RC4PPS           EQU  H'0EA4'
RC5PPS           EQU  H'0EA5'

;-----Bank30------------------
CLCDATA          EQU  H'0F0F'
CLC1CON          EQU  H'0F10'
CLC1POL          EQU  H'0F11'
CLC1SEL0         EQU  H'0F12'
CLC1SEL1         EQU  H'0F13'
CLC1SEL2         EQU  H'0F14'
CLC1SEL3         EQU  H'0F15'
CLC1GLS0         EQU  H'0F16'
CLC1GLS1         EQU  H'0F17'
CLC1GLS2         EQU  H'0F18'
CLC1GLS3         EQU  H'0F19'
CLC2CON          EQU  H'0F1A'
CLC2POL          EQU  H'0F1B'
CLC2SEL0         EQU  H'0F1C'
CLC2SEL1         EQU  H'0F1D'
CLC2SEL2         EQU  H'0F1E'
CLC2SEL3         EQU  H'0F1F'
CLC2GLS0         EQU  H'0F20'
CLC2GLS1         EQU  H'0F21'
CLC2GLS2         EQU  H'0F22'
CLC2GLS3         EQU  H'0F23'

;-----Bank31------------------
STATUS_SHAD      EQU  H'0FE4'
WREG_SHAD        EQU  H'0FE5'
BSR_SHAD         EQU  H'0FE6'
PCLATH_SHAD      EQU  H'0FE7'
FSR0L_SHAD       EQU  H'0FE8'
FSR0H_SHAD       EQU  H'0FE9'
FSR1L_SHAD       EQU  H'0FEA'
FSR1H_SHAD       EQU  H'0FEB'
STKPTR           EQU  H'0FED'
TOSL             EQU  H'0FEE'
TOSH             EQU  H'0FEF'

;----- STATUS Bits -----------------------------------------------------
C                EQU  H'0000'
DC               EQU  H'0001'
Z                EQU  H'0002'
NOT_PD           EQU  H'0003'
NOT_TO           EQU  H'0004'


;----- BSR Bits -----------------------------------------------------
BSR0             EQU  H'0000'
BSR1             EQU  H'0001'
BSR2             EQU  H'0002'
BSR3             EQU  H'0003'
BSR4             EQU  H'0004'


;----- INTCON Bits -----------------------------------------------------
INTEDG           EQU  H'0000'
PEIE             EQU  H'0006'
GIE              EQU  H'0007'


;----- PORTA Bits -----------------------------------------------------
RA0              EQU  H'0000'
RA1              EQU  H'0001'
RA2              EQU  H'0002'
RA3              EQU  H'0003'
RA4              EQU  H'0004'
RA5              EQU  H'0005'


;----- PORTC Bits -----------------------------------------------------
RC0              EQU  H'0000'
RC1              EQU  H'0001'
RC2              EQU  H'0002'
RC3              EQU  H'0003'
RC4              EQU  H'0004'
RC5              EQU  H'0005'


;----- PIR0 Bits -----------------------------------------------------
INTF             EQU  H'0000'
IOCIF            EQU  H'0004'
TMR0IF           EQU  H'0005'


;----- PIR1 Bits -----------------------------------------------------
TMR1IF           EQU  H'0000'
TMR2IF           EQU  H'0001'
BCL1IF           EQU  H'0002'
SSP1IF           EQU  H'0003'
TXIF             EQU  H'0004'
RCIF             EQU  H'0005'
ADIF             EQU  H'0006'
TMR1GIF          EQU  H'0007'


;----- PIR2 Bits -----------------------------------------------------
NCO1IF           EQU  H'0000'
NVMIF            EQU  H'0004'
C1IF             EQU  H'0005'
C2IF             EQU  H'0006'


;----- PIR3 Bits -----------------------------------------------------
CLC1IF           EQU  H'0000'
CLC2IF           EQU  H'0001'
CSWIF            EQU  H'0006'
OSFIF            EQU  H'0007'


;----- PIR4 Bits -----------------------------------------------------
CCP1IF           EQU  H'0000'
CCP2IF           EQU  H'0001'
CWG1IF           EQU  H'0006'


;----- TMR0L Bits -----------------------------------------------------
TMR00            EQU  H'0000'
TMR01            EQU  H'0001'
TMR02            EQU  H'0002'
TMR03            EQU  H'0003'
TMR04            EQU  H'0004'
TMR05            EQU  H'0005'
TMR06            EQU  H'0006'
TMR07            EQU  H'0007'


;----- TMR0H Bits -----------------------------------------------------
TMR08            EQU  H'0000'
TMR09            EQU  H'0001'
TMR010           EQU  H'0002'
TMR011           EQU  H'0003'
TMR012           EQU  H'0004'
TMR013           EQU  H'0005'
TMR014           EQU  H'0006'
TMR015           EQU  H'0007'


;----- T0CON0 Bits -----------------------------------------------------
T016BIT          EQU  H'0004'
T0OUT            EQU  H'0005'
T0EN             EQU  H'0007'

